## DataFrame - Practice1 - CREATE
Q1. Before you can use pandas, what code do you need to do it (once)? Type and the code below.

In [1]:
# Q1 Type the answer here
import pandas as pd
import numpy as np

Q2. Create a dataframe as shown here.

| ` ` | `StudentID` | `NickName` | `Major` |
| --- | --- | --- | --- |
| 0 | 6781234 | Tom | BA |
| 1 | 678222 | Tim | CH |
| 2 | 678333 | Ted | CS |
| 3 | 678444 | Tan | FS |

In [3]:
# Q2 Type your answer here
df1 =  {"StudentID":['6281234','678222','678333','678444'], "NickName":['Tom','Tim','Ted','Tan'], "Major":['BA','CH','CS','FS']}
df11 = pd.DataFrame(df1)
df11

  StudentID NickName Major
0   6281234      Tom    BA
1    678222      Tim    CH
2    678333      Ted    CS
3    678444      Tan    FS

In [4]:
my_dt = {'StudentID': [6781234,678222,678333,678444], 'NickName':['Tom','Ted','Tim','Tan']}
df1 = pd.DataFrame(my_dt)
df1

   StudentID NickName
0    6781234      Tom
1     678222      Ted
2     678333      Tim
3     678444      Tan

Q3. Create a dataframe with data as shown in Q2. Set the index label are "Thomas", "Timmothy", "Teddy", "Tenet".

In [5]:
myList = ["Thomas", "Timmothy", "Teddy", "Tenet"]
df2 = pd.DataFrame(myList)
df2

          0
0    Thomas
1  Timmothy
2     Teddy
3     Tenet

Q4. Create a dataframe you did in Q3 by starting with an empty dataframe and manually set each column to a series.

In [7]:
#Q4 Type your answer here
df4 = pd.DataFrame() # Create empty dataframe

ser1 = pd.Series([6781234,678222,678333,678444])      # Create a series from a list
ser2 = pd.Series(["Tom","Tim","Ted","Tan"])     # Create a series from a list
ser3 = pd.Series(["BA","CH","CS","FS"])      # Create a series from a list

df4["StudentID"]=ser1 # Manually set column StudentID to ser1
df4["NickName"]=ser2  # Manually set column NickName to ser2
df4["Major"]=ser3  # Manually set column Major to ser3

my_index = pd.Series(["Thomas","Timmothy","Teddy","Tenet"])              # Create a series from a list
df4.set_index(my_index,inplace=True)           # Set index of our dataframe to the list we just created
df4

          StudentID NickName Major
Thomas      6781234      Tom    BA
Timmothy     678222      Tim    CH
Teddy        678333      Ted    CS
Tenet        678444      Tan    FS